Перем НачалоПериода;
Перем ПоквартальныйУчет;

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ
//
//******************************************************************************
//	Предопределенная процедура.
//
Процедура ОбработкаПроведения(Отказ, Режим)
//	
//	Если ПустоеЗначение(СторнируемыйДокумент) = 1 Тогда
//		глНеПроводить(Контекст, "Не выбран сторнируемый документ.");
//		Возврат;
//	КонецЕсли;
//	
//	// Проверка сторнированности документа.
//	
//	Объект = СоздатьОбъект("Документ");
//	Объект.ВыбратьПодчиненныеДокументы(,, СторнируемыйДокумент);
//	
//	Пока Объект.ПолучитьДокумент() = 1 Цикл
//		Если (Объект.Вид() = "Сторно") И (Объект.Проведен() = 1) И (Объект.ТекущийДокумент() <> ТекущийДокумент()) Тогда
//			глНеПроводить(Контекст, "Сторнируемый документ уже сторнирован документом № "+Объект.НомерДок+" от "+Объект.ДатаДок);
//			Возврат;
//		КонецЕсли;
//	КонецЦикла;                                      
//	
//	ПоквартальныйУчет = Фирма.ЮрЛицо.УчитыватьНДСПоквартально.Получить(ДатаДок);
//	
//	Если ПоквартальныйУчет = 0 Тогда
//		НачалоПериода = НачМесяца(ДатаДок);
//		
//	Иначе
//		НачалоПериода = НачКвартала(ДатаДок);
//		
//	КонецЕсли;
//
//	Если Метаданные.Документ(СторнируемыйДокумент.Вид()).ОперативныйУчет = 1 Тогда
//		
//		Для Сч = 1 По Метаданные.Регистр() Цикл 
//			
//			ИмяРегистра = Метаданные.Регистр(Сч).Идентификатор;
//			Рег         = СоздатьОбъект("Регистр." + ИмяРегистра);
//			РегСторно   = Регистр.ПолучитьАтрибут(ИмяРегистра);
//			
//			Если ((ИмяРегистра = "КнигаПокупок") ИЛИ (ИмяРегистра = "КнигаПродаж")) И (НеОтражатьВКнигеПокупокПродаж = 1) Тогда
//			    Продолжить;
//			КонецЕсли;
//
//			Если Рег.ВыбратьДвиженияДокумента(СторнируемыйДокумент)=1 Тогда
//				
//				Пока Рег.ПолучитьДвижение()=1 Цикл
//					
//					МДОперация = ?(Рег.Приход=1,"Приход","Расход");
//					
//					// заполняем измерения
//					Для Сч2 = 1 По  Метаданные.Регистр(Сч).Измерение() Цикл                     
//						РегСторно.УстановитьАтрибут(Метаданные.Регистр(Сч).Измерение(Сч2).Идентификатор, Рег.ПолучитьАтрибут(Метаданные.Регистр(Сч).Измерение(Сч2).Идентификатор));
//					КонецЦикла;
//					
//					// заполняем реквизиты
//					Для Сч2 = 1 По  Метаданные.Регистр(Сч).Реквизит() Цикл                     
//						ЗначениеРеквизита = Рег.ПолучитьАтрибут(Метаданные.Регистр(Сч).Реквизит(Сч2).Идентификатор);
//						Если ТипЗначенияСтр(ЗначениеРеквизита) = "Число" Тогда
//							ЗначениеРеквизита = - ЗначениеРеквизита;
//						КонецЕсли;
//						РегСторно.УстановитьАтрибут(Метаданные.Регистр(Сч).Реквизит(Сч2).Идентификатор, ЗначениеРеквизита);
//					КонецЦикла;      
//					
//					// Номер строки документа-основания
//					РегСторно.ПривязыватьСтроку(Рег.НомерСтроки());   
//					
//					// заполняем ресурсы
//					Для Сч2 = 1 По  Метаданные.Регистр(Сч).Ресурс() Цикл                     
//						РегСторно.УстановитьАтрибут(Метаданные.Регистр(Сч).Ресурс(Сч2).Идентификатор, -Рег.ПолучитьАтрибут(Метаданные.Регистр(Сч).Ресурс(Сч2).Идентификатор));
//					КонецЦикла;     
//
//					// Если мы сторнируем книгу покупок или книгу продаж, то эти записи должны попадать в дополнительные листы
//					// (в случае, если мы сторнируем документ прошлого периода)
//					Если ((ИмяРегистра = "КнигаПокупок") Или (ИмяРегистра = "КнигаПродаж"))
//					   И (НачалоПериода >  ?(ПоквартальныйУчет = 1, НачКвартала(СторнируемыйДокумент.ДатаДок),НачМесяца(СторнируемыйДокумент.ДатаДок))) Тогда
//					   	РегСторно.ЗаписьДополнительногоЛиста = 1;
//					   	РегСторно.КорректируемыйПериод       = СторнируемыйДокумент.ДатаДок;
//					КонецЕсли;
//					
//					// движение сторно       
//					
//					Если Рег.Приход = 1	Тогда					
//						РегСторно.ДвижениеПриходВыполнить();
//					Иначе
//						РегСторно.ДвижениеРасходВыполнить();
//					КонецЕсли;	 
//	
//				   	//Если (СторнируемыйДокумент.Вид() <> "ЗаписьКнигиПокупок") и  (СторнируемыйДокумент.Вид() <> "ЗаписьКнигиПродаж") Тогда
//					//	
//					//	// Сразу закроем остатки по книге покупок (продаж), чтобы не анализировать их 
//					//	// документом "Формирование книги покупок (продаж)"
//					//	Если (ИмяРегистра = "КнигаПокупок") Или (ИмяРегистра = "КнигаПродаж") 
//					//	И (НачМесяца(ДатаДок) > НачМесяца(СторнируемыйДокумент.ДатаДок)) Тогда
//					//		Если (ИмяРегистра = "КнигаПокупок") И (Рег.Расход = 1) Тогда
//					//			РегСторно.ДвижениеПриходВыполнить();
//					//		ИначеЕсли (ИмяРегистра = "КнигаПродаж") И (Рег.Приход = 1) Тогда
//					//			РегСторно.ДвижениеРасходВыполнить();
//					//		КонецЕсли;
//					//	КонецЕсли;
//					//КонецЕсли;
//					
//				КонецЦикла;
//			КонецЕсли;
//		КонецЦикла;	
//	КонецЕсли;
//	
//	
КонецПроцедуры // ОбработкаПроведения()
//
