// ********************
//
Процедура ОбработкаПроведения(Отказ, Режим)
//
//    //Здесь следует написать алгоритм проведения документа
//
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Режим)
	Сумма_Итог = ТабличнаяЧасть1.Итог("Сумма");
	СуммаНДС_Итог = ТабличнаяЧасть1.Итог("СуммаНДС");
	СуммаДоИзменения_Итог = ТабличнаяЧасть1.Итог("СуммаДоИзменения");
	СуммаНДСДоИзменения_Итог = ТабличнаяЧасть1.Итог("СуммаНДСДоИзменения");
	СуммаРазницаКУменьшению_Итог = ТабличнаяЧасть1.Итог("СуммаРазницаКУменьшению");
	СуммаНДСРазницаКУменьшению_Итог = ТабличнаяЧасть1.Итог("СуммаНДСРазницаКУменьшению");
	СуммаРазницаКДоплате_Итог = ТабличнаяЧасть1.Итог("СуммаРазницаКДоплате");
	СуммаНДСРазницаКДоплате_Итог = ТабличнаяЧасть1.Итог("СуммаНДСРазницаКДоплате");
КонецПроцедуры
