////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ
//
//******************************************************************************
// ПроведениеПоРегистрам()
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
// Описание:
//  Проведение по регистрам оперативного учета.
//
Процедура ПроведениеПоРегистрам()
	
	Перем ТаблицаДокумента;                  
//
//	// Удаление движений по регистрам.
//	Для Номер = 1 По Метаданные.Регистр() Цикл
//		ОчиститьДвижения("Регистр."+Метаданные.Регистр(Номер).Идентификатор);
//	КонецЦикла;
//
//	Если (СФНаАванс = 1) И (СчетНаОплату.Выбран() = 1) Тогда         
//		ТаблицаДокумента=глПодготовитьТаблицуДокумента(СчетНаОплату);
//		СуммаПоСчету = ТаблицаДокумента.Итог("СуммаРуб");
//		К = 0;
//        Если (ДокОснование.Выбран() = 1) И (СуммаПоСчету > 0) Тогда
//			
//			Если СуммаАвансаПоУчету = 1 Тогда 
//				СуммаАвансаОснования = 0;
//				РегПокупатели = СоздатьОбъект("Регистр.Покупатели");
//				РегПокупатели.ВыбратьДвиженияДокумента(ДокОснование);
//				Пока РегПокупатели.ПолучитьДвижение() = 1 Цикл
//					Если РегПокупатели.ВидДолга = глВД.Аванс Тогда
//						СуммаАвансаОснования = СуммаАвансаОснования + РегПокупатели.СуммаРуб - РегПокупатели.СуммаНП;
//					КонецЕсли;
//				КонецЦикла;
//				
//				К = СуммаАвансаОснования / СуммаПоСчету;
//				
//			Иначе		
//				К = глПересчет(ДокОснование.Сумма, ДокОснование.Валюта, ДокОснование.Курс, глРубли, 1, ДокОснование.Кратность, 1) / СуммаПоСчету;
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//
//	Иначе
//		К = 1;
//		ТаблицаДокумента=глПодготовитьТаблицуДокумента(Контекст);
//	
//	КонецЕсли;
//	
//	
//	ТаблицаДокумента.Свернуть("СтавкаНДС","СуммаРуб,СуммаНДС,СуммаНП");
//	                              
//	ТекДок   = ТекущийДокумент();
//	РегКнига = Регистр.КнигаПродаж;
//	
//	ТаблицаДокумента.ВыбратьСтроки();
//	Пока ТаблицаДокумента.ПолучитьСтроку() = 1 Цикл
//		РегКнига.КредДокумент	= ?(СФНаАванс = 1,?(ДокОснование.Выбран() = 1, ДокОснование, ТекДок),ТекДок);
//		РегКнига.ВидДолга		= ?(СФНаАванс = 1,глВД.Аванс,  глВД.Прочее);
//		РегКнига.СтавкаНДС		= ТаблицаДокумента.СтавкаНДС;
//			
//		РегКнига.СуммаРуб       = К * ТаблицаДокумента.СуммаРуб;
//		РегКнига.СуммаНДС       = К * ТаблицаДокумента.СуммаНДС;
//		РегКнига.СуммаНП        = К * ТаблицаДокумента.СуммаНП;
//			                           
//		РегКнига.КодОперации 	= глКО.Прочее;
//		Если ДокОснование.Выбран() = 1 Тогда
//			Если ДокОснование.Вид() = "ВводОстатковПокупателя" Тогда
//				РегКнига.КодОперации 	= глКО.ВводОстатков;
//			КонецЕсли;
//		КонецЕсли;
//			                                 
//		Если СФНаАванс = 1 Тогда         
//			РегКнига.ДокументОплаты = ДокОснование;
//			РегКнига.ДвижениеРасходВыполнить();
//		Иначе
//			РегКнига.ДокументОплаты = "";
//			РегКнига.ДвижениеПриходВыполнить();
//		КонецЕсли;
//	КонецЦикла;
//               
КонецПроцедуры // ПроведениеПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ
//
//******************************************************************************
// Предопределенная процедура.
//
Процедура ОбработкаПроведения(Отказ, Режим)
//
//	Валюта	         = глРубли; 
//	Курс    		 = 1;
//	Кратность        = 1;
//	СписокРеквизитов = "Фирма,Контрагент,Договор";
//	 
//	Если (ДокОснование.Выбран() = 1) Тогда		
//		Фирма  = ДокОснование.Фирма; // перезапишем реквизит.
//		ВидОсн = ДокОснование.Вид();
//		Если (глЕстьРеквизитШапки("Валюта",ВидОсн) = 1)
//		и    (СФНаАванс = 0)         
//		и    ((ВидОсн <> "ОтчетКомитенту") и (ВидОсн <> "ЗакрытиеМесяца"))
//		Тогда
//		    Валюта    = ДокОснование.Валюта;
//			Курс 	  = ДокОснование.Курс;
//			Кратность = ДокОснование.Кратность;
//
//		КонецЕсли;            
//		Если ДатаМесяц(ДокОснование.ДатаДок) <> ДатаМесяц(ДатаДок) Тогда
//			глСообщениеПроведения("Дата документа-основания и дата счета-фактуры находятся в разных месяцах!
//			|В книге продаж за месяц операция отражена не будет!", ДокОснование,, ТекущийДокумент());
//		КонецЕсли;
//	    Если ВидОсн = "ЗакрытиеМесяца" Тогда
//			СписокРеквизитов = "Фирма";
//	    КонецЕсли;
//	КонецЕсли;
//	
//	// Проверка заполненности обязательных реквизитов.
//	Если глВсеРеквизитыДокументаЗаполнены(Контекст, СписокРеквизитов) = 0 Тогда 
//		Возврат;
//	КонецЕсли;    
//	                                          
//	ПозицияГП  = Последовательность.КнигаПродаж.ПолучитьПозицию();
//	ПозицияДок = ПолучитьПозицию();
//	Последовательность.КнигаПродаж.Установить(?(ПозицияГП<ПозицияДок,ПозицияГП,ПозицияДок));
//
//	Если ДокОснование.Проведен()=0 Тогда
//		глНеПроводить(Контекст, "Документ - основание не проведен!");
//		Возврат;
//	КонецЕсли;
//	
//	// Если НДС был проведен документом оприходования, ничего не делаем
//	Если  (ДокОснование.Выбран() = 0) 
//	  или (СФНаАванс = 1)  Тогда
//	
//		// Проведение по регистрам оперативного учета.	
//		Если (ПустоеЗначение(ВидыДвижений) = 1) ИЛИ (Найти(ВидыДвижений, "Регистр") <> 0) Тогда
//			ПроведениеПоРегистрам();
//		
//			Если СтатусВозврата() = 0 Тогда
//				Возврат;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//	глПриПроведении(Контекст, ВидыДвижений);
//	
КонецПроцедуры //ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, Режим)
	Сумма_Итог = ТабличнаяЧасть1.Итог("Сумма");
	СуммаНДС_Итог = ТабличнаяЧасть1.Итог("СуммаНДС");
	СуммаНП_Итог = ТабличнаяЧасть1.Итог("СуммаНП");
КонецПроцедуры
//
//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
//
